Revit 2026 API

# ColorFillSchemeSetFormatOptions Method

---

Sets the FormatOptions of the scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFormatOptions(
	FormatOptions formatOptions
)
```
```vb
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
```
```cpp
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
```
```fsharp
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
```

#### Parameters

formatOptions FormatOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method will set the FormatOptions if the scheme is by range, otherwise do nothing.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace